vmux0.0.10/ycsbVMs_ycsb_32vms_bridge-e1000_-1rps_rep1/vm15.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-10-15 13:07:06:400 0 sec: 0 operations; est completion in 0 second 
2024-10-15 13:07:16:171 10 sec: 39333 operations; 3933.3 current ops/sec; est completion in 1 day 6 hours [READ: Count=19676, Max=59903, Min=110, Avg=243.38, 90=301, 99=389, 99.9=2531, 99.99=5851] [UPDATE: Count=19678, Max=6255, Min=109, Avg=241.27, 90=300, 99=431, 99.9=2937, 99.99=5691] 
2024-10-15 13:07:26:170 20 sec: 87461 operations; 4812.8 current ops/sec; est completion in 1 day 3 hours [READ: Count=24045, Max=10263, Min=104, Avg=206.42, 90=287, 99=426, 99.9=721, 99.99=2109] [UPDATE: Count=24062, Max=1445, Min=105, Avg=202.56, 90=286, 99=423, 99.9=621, 99.99=1089] 
2024-10-15 13:07:36:170 30 sec: 135843 operations; 4838.2 current ops/sec; est completion in 1 day 2 hours [READ: Count=24383, Max=3311, Min=106, Avg=206.02, 90=284, 99=307, 99.9=422, 99.99=2709] [UPDATE: Count=23999, Max=7119, Min=102, Avg=203.21, 90=283, 99=306, 99.9=412, 99.99=1127] 
2024-10-15 13:07:46:170 40 sec: 185067 operations; 4922.4 current ops/sec; est completion in 1 day 1 hour [READ: Count=24748, Max=1276, Min=108, Avg=202.63, 90=283, 99=306, 99.9=345, 99.99=761] [UPDATE: Count=24476, Max=7695, Min=104, Avg=199.73, 90=281, 99=303, 99.9=333, 99.99=723] 
2024-10-15 13:07:56:170 50 sec: 232939 operations; 4787.2 current ops/sec; est completion in 1 day 1 hour [READ: Count=23935, Max=1849, Min=106, Avg=208.41, 90=287, 99=338, 99.9=441, 99.99=746] [UPDATE: Count=23937, Max=7591, Min=102, Avg=205.17, 90=285, 99=334, 99.9=453, 99.99=775] 
2024-10-15 13:08:06:170 60 sec: 278100 operations; 4516.1 current ops/sec; est completion in 1 day 1 hour [READ: Count=22547, Max=854, Min=108, Avg=221.13, 90=292, 99=318, 99.9=417, 99.99=732] [UPDATE: Count=22614, Max=5047, Min=104, Avg=217.33, 90=291, 99=315, 99.9=383, 99.99=2759] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-10-15 13:08:07:183 61 sec: 283327 operations; 5165.02 current ops/sec; est completion in 1 day 1 hour [READ: Count=2626, Max=346, Min=104, Avg=191.61, 90=281, 99=304, 99.9=325, 99.99=346] [CLEANUP: Count=1, Max=898, Min=898, Avg=898, 90=898, 99=898, 99.9=898, 99.99=898] [UPDATE: Count=2601, Max=3543, Min=102, Avg=190.91, 90=281, 99=308, 99.9=342, 99.99=3543] 
[OVERALL], RunTime(ms), 61016
[OVERALL], Throughput(ops/sec), 4643.486954241511
[TOTAL_GCS_Copy], Count, 26
[TOTAL_GC_TIME_Copy], Time(ms), 22
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03605611642847777
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 26
[TOTAL_GC_TIME], Time(ms), 22
[TOTAL_GC_TIME_%], Time(%), 0.03605611642847777
[READ], Operations, 141960
[READ], AverageLatency(us), 213.2102986756833
[READ], MinLatency(us), 104
[READ], MaxLatency(us), 59903
[READ], 95thPercentileLatency(us), 299
[READ], 99thPercentileLatency(us), 332
[READ], Return=OK, 141960
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 898.0
[CLEANUP], MinLatency(us), 898
[CLEANUP], MaxLatency(us), 898
[CLEANUP], 95thPercentileLatency(us), 898
[CLEANUP], 99thPercentileLatency(us), 898
[UPDATE], Operations, 141367
[UPDATE], AverageLatency(us), 210.15959877482015
[UPDATE], MinLatency(us), 102
[UPDATE], MaxLatency(us), 7695
[UPDATE], 95thPercentileLatency(us), 297
[UPDATE], 99thPercentileLatency(us), 332
[UPDATE], Return=OK, 141367
AUTOTEST_DONE